      *-----------------------------------------------------------------
       IDENTIFICATION                      DIVISION.
      *-----------------------------------------------------------------
       PROGRAM-ID.                         TAV2DIM.
       AUTHOR.                             Amitay Drummer.
       DATE-WRITTEN.                       22/9/2024.
      *REMARKS.                            this is a sample program
                                           that it's propose is to 
                                           demonstrate the Hebrew
                                           standard for Cobol
                                           (TEKEN-IVRIT)
      *-----------------------------------------------------------------
       ENVIRONMENT DIVISION.
      *-----------------------------------------------------------------
       DATA                                DIVISION.
      *-----------------------------------------------------------------
       WORKING-STORAGE                     SECTION.
      *-----------------------------------------------------------------
      *Cxx-Kvuim
      *-----------------------------------------------------------------
       01  C00.
           03  C01-MISPAR-OVDIM            PIC 9 VALUE 8.
      *-----------------------------------------------------------------
      *EZxx-EZER
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
      *Hxx-HODAOT
      *-----------------------------------------------------------------
       01  H00.
           03  H01-KELET-OVED.
           03  H04-KELET-CHODESH-LEDILUG
                                           VALUE "Please type salary".


      *-----------------------------------------------------------------
      *IXxx-INDEXIM
      *-----------------------------------------------------------------
       01  IX00.
           03  IX01-OVED                   PIC 9.
           03  IX02-CHODESH                PIC 9.
      *-----------------------------------------------------------------
      *Kxx-KELET
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
      *Mxx-MONIM
      *-----------------------------------------------------------------
       01  M00.
           03  M01-SCHUM                   PIC 9(8) VALUE 0.
           03  M02-SCHUM-OVED              PIC 9(6) VALUE 0.
           03  M03-SCHUM-SHAOT             PIC 9(5) VALUE 0.
      *-----------------------------------------------------------------
      *MHxx-MAFTECHOT-HASHVAA
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
      *Pxx-PELET
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
      *PRxx-PARAMETRIM
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
      *SXxx-SHUROT
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
      *SW-xx-METAGIM
      *-----------------------------------------------------------------
       01  SW00.
           03  SW01-CATEGORYAT-MASKORET    PIC 9.
               88  SW01-MASKORET-MEAL-SAF            VALUE 1.
               88  SW01-MASKORET-MITACHAT-LASAF      VALUE 0.
      *-----------------------------------------------------------------
      *TVxx-TAVLAOT
      *-----------------------------------------------------------------
       01  TV00.
           03  TV01-OVDIM.
               05  TV01-OVED OCCURS 8 TIMES.
                   07  TV01-SHEM-OVED      PIC X(5).
                   07  TV01-DARGAT-OVED    PIC 99.

       PROCEDURE                           DIVISION.
      *-----------------------------------------------------------------
       A-MAIN                              SECTION.
      *-----------------------------------------------------------------
       A-00.
           PERFROM B-KELET
           STOP RUN
           .
       A-EXIT.
           EXIT.
      *-----------------------------------------------------------------
       B-KELET                             SECTION.
      *-----------------------------------------------------------------
       B-00.
           .
       B-EXIT.
           EXIT.
